Documents/Парковка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Парковка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Посещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВъездаНаПарковку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыездаСПарковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПосещениеЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Парковка/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

&Вместо("ПередЗаписью")
Процедура PocketKey_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//++ ЗМВ 02.07.2025
	КрайнееПосещение 	= ЕстьПосещениеЗаДень(Клиент);
	ЕстьПарковка		= КрайнийДокументПарковки(Клиент); 
	
	Если ДатаВъезда = ДатаВыезда Тогда
		//++ ЗМВ 18.08.2025
		Если НЕ ЕстьПарковка = Неопределено Тогда
			Для каждого Строка1 Из ЕстьПарковка Цикл
				ДатаВъезда = Строка1.ДатаВыезда;
			КонецЦикла;
		Иначе
			Если НЕ КрайнееПосещение = Неопределено Тогда
				Если КрайнееПосещение.Количество() > 0 Тогда
					Для каждого Строка Из КрайнееПосещение Цикл   
						ДатаВъезда = Строка.ДатаПрихода;		   
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		//-- ЗМВ 18.08.2025	
	КонецЕсли;
	//-- ЗМВ 02.07.2025
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	ПродолжитьВызов(Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

&Вместо("ПередУдалением")
Процедура PocketKey_ПередУдалением(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	ПродолжитьВызов(Отказ);
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура PocketKey_ОбработкаУдаленияПроведения(Отказ)
	ЭтотОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	ПродолжитьВызов(Отказ);
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура PocketKey_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ ЗМВ 23.07.2025
	КрайнееПосещение = ЕстьПосещениеЗаДень(Клиент);
	
	Если НЕ КрайнееПосещение = Неопределено Тогда
		Если КрайнееПосещение.Количество() > 0 Тогда
			Для каждого Строка Из КрайнееПосещение Цикл 
				Если НЕ ЗначениеЗаполнено(Строка.ДатаВъездаНаПарковку) ИЛИ НЕ ЗначениеЗаполнено(Строка.ДатаВыездаСПарковки) Тогда
					ОбъектПосещения 						= Строка.Ссылка.ПолучитьОбъект();
					ОбъектПосещения.ДатаВъездаНаПарковку 	= ДатаВъезда;
					ОбъектПосещения.ДатаВыездаСПарковки 	= ДатаВыезда;
					ОбъектПосещения.Записать(РежимЗаписиДокумента.Запись)
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
    //-- ЗМВ 23.07.2025
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ ЗМВ 02.07.2025

//Функция возвращает крайнее посещение клиента за текущий день
//
//Контрагент - СправочникСсылка.Контрагент - Контрагент 
//
Функция ЕстьПосещениеЗаДень(Контрагент)
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Посещение.Ссылка КАК Ссылка,
	|	Посещение.ДатаПрихода КАК ДатаПрихода,
	|	Посещение.ДатаУхода КАК ДатаУхода,
	|	Посещение.ДатаВъездаНаПарковку КАК ДатаВъездаНаПарковку,
	|	Посещение.ДатаВыездаСПарковки КАК ДатаВыездаСПарковки
	|ИЗ
	|	Документ.Посещение КАК Посещение
	|ГДЕ
	|	Посещение.Проведен
	|	И Посещение.Контрагент = &Контрагент
	|	И Посещение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	Посещение.Дата УБЫВ
	|";
	
	Запрос = Новый Запрос(лТекст);
	
	// Установка параметров.
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() <> 0 Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 
//-- ЗМВ 02.07.2025

//++ ЗМВ 18.08.2025

// Функция возвращает крайний документ парковки клиента
//
// Параметры:
// Контрагент - СправочникСсылка.Контрагент - Контрагент
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция КрайнийДокументПарковки(Контрагент)
	
	лТекст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Парковка.Ссылка КАК Ссылка,
	|	Парковка.Клиент КАК Клиент,
	|	Парковка.Дата КАК Дата,
	|	Парковка.ДатаВъезда КАК ДатаВъезда,
	|	Парковка.ДатаВыезда КАК ДатаВыезда
	|ИЗ
	|	Документ.Парковка КАК Парковка
	|ГДЕ
	|	Парковка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ Парковка.ПометкаУдаления
	|	И Парковка.Клиент = &Клиент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|";
	
	лЗапрос = Новый Запрос(лТекст);
		
	// Установка параметров.
	лЗапрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
	лЗапрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	лЗапрос.УстановитьПараметр("Клиент", Контрагент);
	
	Выборка = лЗапрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() <> 0 Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;		
	КонецЕсли; 
	
КонецФункции 
//-- ЗМВ 18.08.2025

#КонецОбласти
